# AreaBasedLoadBoundaryLineData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadBoundaryLineData Class
Members See Also
---
Wrapper class used to access area based load boundary line related data.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AreaBasedLoadBoundaryLineData : IDisposable
```

Visual Basic
---
```text
Public Class AreaBasedLoadBoundaryLineData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AreaBasedLoadBoundaryLineData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Electrical..::..AreaBasedLoadBoundaryLineData
# See Also
AreaBasedLoadBoundaryLineData Members
Autodesk.Revit.DB.Electrical Namespace